Revit 2026 API

# MassSurfaceDataSource Enumeration

---

Indicates whether values for the properties of the MassSurfaceData are synchronized with the EnergyDataSettings of the document or instead, serve as overrides of those settings.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MassSurfaceDataSource
```
```vb
Public Enumeration MassSurfaceDataSource
```
```cpp
public enum class MassSurfaceDataSource
```
```fsharp
type MassSurfaceDataSource
```

| Member name | Value | Description |
| --- | --- | --- |
| EnergyData | 0 | Synchronize with the EnergyDataSettings. |
| Invalid | -1 | This value indicates that the parameter has not been properly set. |
| Surface | 1 | Override the EnergyDataSettings values for the surface. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace